---
Description: Downloads the latest version of ExifRenamer.
Identifier: com.github.frzk.download.ExifRenamer
Input:
  NAME: "exifrenamer"
MinimumVersion: "2.3"
Process:
  - Processor: URLDownloader
    Arguments:
      url: https://www.qdev.de/downloads/files/ExifRenamer.dmg
      filename: "%NAME%.dmg"
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/ExifRenamer.app"
      requirement: "anchor apple generic and identifier \"de.qdev.ExifRenamer\" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = \"MLF9FE35AM\")"
...
