Description: |
  Downloads the chosen version of LibreOffice.
  Set VERSION to the desired version of LibreOffice.
  Set ARCH to either "aarch64" for Apple Silicon, or "x86_64" for Intel.
Identifier: com.github.frzk.download.LibreOffice
Input:
  NAME: libreoffice
  VERSION: "7.5.7"
  ARCH: aarch64
MinimumVersion: "0.4.0"
Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (LibreOffice_(?P<version_number>[\d\.]+)_MacOS_(aarch|x86_)64.dmg)
      url: "https://download.documentfoundation.org/libreoffice/stable/%VERSION%/mac/%ARCH%/"
      request_headers:
        User-Agent: "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_2) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0.2 Safari/605.1.15"
  - Processor: URLDownloader
    Arguments:
      url: "https://download.documentfoundation.org/libreoffice/stable/%VERSION%/mac/%ARCH%/%match%"
      filename: "%NAME%-%version_number%.dmg"
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/LibreOffice.app"
      requirement: '(identifier "org.libreoffice.script.LibreOffice" or identifier "org.libreoffice.script") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7P5S3ZLCN7"'
      strict_verification: yes
