---
Description: Downloads Munki from GitHub and creates a few packages from it (core, app, launchd and python). The embedded Python framework can be codesigned by providing %SIGNING_CERT%.
Identifier: com.github.frzk.pkg.munkitools_main
Input:
  SIGNING_CERT: ""
  MUNKI_REPO_SUBDIR: apps/munkitools
  INCLUDE_PRERELEASES: ""
MinimumVersion: "2.3"
ParentRecipe: com.github.frzk.download.munkitools_main
Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/repack"
      pkgdirs: {}
  # core
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_core*.pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg"
  # app
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_app[.-]*pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_app.pkg"
  # launchd
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_launchd*.pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_launchd.pkg"
  # python
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_python*.pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/munki_python.pkg"
  # Read package version and identifier
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%RECIPE_CACHE_DIR%/munki_python.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/unpacked"
      skip_payload: yes
  - Processor: com.github.frzk.autopkg-recipes.SharedProcessors/PackageInfoReader
    Arguments:
      pkginfo_path: "%RECIPE_CACHE_DIR%/unpacked/PackageInfo"
  # Unpack package payload and sign files
  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%found_filename%/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/unpack/python"
  - Processor: com.github.frzk.autopkg-recipes.SharedProcessors/PythonCodeSigner
    Arguments:
      signing_cert: "%SIGNING_CERT%"
      python_framework_path: "%RECIPE_CACHE_DIR%/unpack/python/usr/local/munki/Python.framework/Versions/Current"
  # Repack the files
  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgroot: "%RECIPE_CACHE_DIR%/unpack/python"
        pkgdir: "%RECIPE_CACHE_DIR%/repack"
        pkgname: "munkitools_python"
        type: flat
        id: "%pkg_id%"
        version: "%pkg_version%"
        options: purge_ds_store
...
