---
Description: Downloads Munki from GitHub, creates several packages from it and imports them into Munki. The embedded Python framework can be codesigned if %SIGNING_CERT% is provided.
Identifier: com.github.frzk.munki.munkitools_main
Input:
  SIGNING_CERT: ""
  #
  MUNKI_CATALOG: "testing"
  MUNKI_CATEGORY: "development"
  MUNKI_REPO_SUBDIR: apps/munkitools
  MUNKI_ICON: ""
  #
  MUNKI_CORE_DISPLAYNAME: "Managed Software Center core tools"
  MUNKI_APP_DISPLAYNAME: "Managed Software Center"
  MUNKI_LAUNCHD_DISPLAYNAME: "Managed Software Center launchd files."
  MUNKI_PYTHON_DISPLAYNAME: "Managed Software Center embedded Python"
  #
  INCLUDE_PRERELEASES: ""
MinimumVersion: "2.3"
ParentRecipe: com.github.frzk.pkg.munkitools_main
Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
      pkginfo:
        catalogs:
          - "%MUNKI_CATALOG%"
        category: "%MUNKI_CATEGORY%"
        display_name: "%MUNKI_CORE_DISPLAYNAME"
        description: "Core command line tools used by Managed Software Center"
        name: munkitools_core
        icon_name: "%MUNKI_ICON%"
        minimum_os_version: "10.11"
        requires:
          - munkitools_python
          - munkitools_launchd
        unattended_install: true
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/repack/munkitools_app.pkg"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
      pkginfo:
        catalogs:
          - "%MUNKI_CATALOG%"
        category: "%MUNKI_CATEGORY%"
        display_name: "%MUNKI_APP_DISPLAYNAME%"
        description: "Managed Software Center application."
        name: munkitools_app
        icon_name: "%MUNKI_ICON%"
        minimum_os_version: "10.11"
        requires:
          - munkitools_python
          - munkitools_core
          - munkitools_launchd
        unattended_install: true
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/repack/munkitools_launchd.pkg"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
      pkginfo:
        catalogs:
          - "%MUNKI_CATALOG%"
        category: "%MUNKI_CATEGORY%"
        display_name: "%MUNKI_LAUNCHD_DISPLAYNAME%"
        description: "launchd configuration files used by Managed Software Center."
        name: munkitools_launchd
        icon_name: "%MUNKI_ICON%"
        minimum_os_version: "10.11"
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/repack/munkitools_python.pkg"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
      pkginfo:
        catalogs:
          - "%MUNKI_CATALOG%"
        category: "%MUNKI_CATEGORY%"
        display_name: "%MUNKI_PYTHON_DISPLAYNAME%"
        description: "Embedded Python tools used by Managed Software Center."
        name: munkitools_python
        icon_name: "%MUNKI_ICON%"
        minimum_os_version: "10.11"
        unattended_install: true
...
