---
Identifier: com.github.frzk.pkg.GoogleEarthPro
Description: Downloads the latest Google Earth disk image and extracts a versioned package out of it.
Input:
  NAME: google_earth_pro
MinimumVersion: "2.3"
ParentRecipe: com.github.frzk.download.GoogleEarthPro
Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%/Install Google Earth*.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/Google_Earth_Pro.pkg/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/payload"
  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/payload/Google Earth Pro.app/Contents/Info.plist"
      plist_version_key: "CFBundleVersion"
  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%/*Earth Pro*.pkg"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
...
