<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports QGIS into Munki.</string>
    <key>Identifier</key>
    <string>com.github.frzk.munki.QGIS</string>
    <key>Input</key>
    <dict>
        <key>RELEASE</key>
        <string>pr</string>
        <key>DOWNLOADED_FILENAME</key>
        <string>qgis-%RELEASE%.dmg</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/qgis</string>
        <key>NAME</key>
        <string>QGIS</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>SIG</string>
            <key>description</key>
            <string>Système d'Information Géographique open-source et multi-plateforme.</string>
            <key>developer</key>
            <string>L'équipe de développement de QGIS</string>
            <key>display_name</key>
            <string>QGIS</string>
            <key>minimum_os_version</key>
            <string>10.13.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.frzk.download.QGIS</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
