---
Description: |-
  Downloads the latest version of QGIS.
  Override RELEASE to get the release type your want: 'pr' for the latest Point Release or 'ltr' for the latest Long Term Release.
Identifier: com.github.frzk.download.QGIS
Input:
  NAME: qgis
  RELEASE: pr
MinimumVersion: "2.3"
Process:
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%RELEASE%.dmg"
      url: "https://qgis.org/downloads/macos/qgis-macos-%RELEASE%.dmg"
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"
  - Processor: EndOfCheckPhase
