<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the specified version of LibreOffice with the specified locale. Set VERSION to the desired version number ("latest" is considered a valid version number) and LANGUAGE_CODE to the desired locale.</string>
    <key>Identifier</key>
    <string>com.github.frzk.download.LibreOfficeLangpack</string>
    <key>Input</key>
    <dict>
        <key>LANGUAGE_CODE</key>
        <string>fr</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>NAME</key>
        <string>libreoffice</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.frzk.download.LibreOffice</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>(LibreOffice_(?P&lt;version_number&gt;[\d\.]+)_MacOS_x86-64_langpack_%LANGUAGE_CODE%.dmg)</string>
                <key>url</key>
                <string>https://downloadarchive.documentfoundation.org/libreoffice/old/%VERSION%/mac/x86_64/</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_2) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0.2 Safari/605.1.15</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>comment</key>
                <string>We stash the .app download path for potential later use (see https://github.com/autopkg/autopkg/wiki/Defining-Custom-Variables).</string>
                <key>app_pathname</key>
                <string>%pathname%</string>
                <key>url</key>
                <string>https://downloadarchive.documentfoundation.org/libreoffice/old/%VERSION%/mac/x86_64/%match%</string>
                <key>filename</key>
                <string>%NAME%-%version_number%_langpack_%LANGUAGE_CODE%.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
