<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, packages and imports the specified version of LibreOffice with the specified locale into Munki. Set VERSION to the desired version number ("latest" is considered a valid version number) and LANGUAGE_CODE to the desired locale.</string>
    <key>Identifier</key>
    <string>com.github.frzk.munki.LibreOfficeLangpack</string>
    <key>Input</key>
    <dict>
        <key>LANGUAGE_CODE</key>
        <string>fr</string>
        <key>VERSION</key>
        <string>latest</version>
        <key>MUNKI_CATEGORY</key>
        <string>Productivity</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/libreoffice</string>
        <key>NAME</key>
        <string>libreoffice</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>LibreOffice is the free power-packed Open Source personal productivity suite for Windows, Macintosh and Linux, that gives you six feature-rich applications for all your document production and data processing needs: Writer, Calc, Impress, Draw, Math and Base.</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>The Document Foundation</string>
            <key>display_name</key>
            <string>LibreOffice</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.9.0</string>
            <key>blocking_applications</key>
            <array>
                <string>LibreOffice</string>
            </array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.frzk.pkg.LibreOfficeLangpack</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
