Description: |
  Downloads, packages and imports the chosen version of LibreOffice in Munki.
  Set VERSION to the desired version of LibreOffice.
  Set ARCH to either "aarch64" for Apple Silicon or "x86_64" for Intel.
  Set LANGUAGE_CODE to the 2-chars language code of your choice. 
Identifier: com.github.frzk.munki.LibreOfficeLangpack
Input:
  NAME: libreoffice
  VERSION: "7.5.7"
  ARCH: aarch64
  LANGUAGE_CODE: fr
  MUNKI_CATEGORY: Productivity
  MUNKI_REPO_SUBDIR: "apps/%NAME%"
  pkginfo:
    catalogs:
      - testing
    category: "%MUNKI_CATEGORY%"
    description: |
      "LibreOffice is the free power-packed Open Source personal productivity
      suite for Windows, Macintosh and Linux, that gives you six feature-rich
      applications for all your document production and data processing needs:
      Writer, Calc, Impress, Draw, Math and Base."
    developer: The Document Foundation
    display_name: LibreOffice
    name: "%NAME%"
    minimum_os_version: "10.9.0"
    blocking_applications:
      - LibreOffice
    unattended_install: yes
    localized_strings:
      fallback_locale: en
      fr:
        category: Bureautique
        description: |
          "LibreOffice est une suite bureautique puissante, libre et open-source.
          Elle intègre plusieurs applications : Writer, Calc, Impress, Draw, Base et Math."
MinimumVersion: "0.4.0"
ParentRecipe: com.github.frzk.pkg.LibreOfficeLangpack
Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pkg_path%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
