---
Description: Downloads Munki from GitHub and creates a package from it. The embedded Python framework will be codesigned.
Identifier: com.github.frzk.pkg.munkitools
Input:
  INCLUDE_PRERELEASES: 
  MUNKI_REPO_SUBDIR: apps/munkitools
MinimumVersion: 2.3
ParentRecipe: com.github.frzk.download.munkitools
Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/repack"
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_core*.pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg"
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_admin*.pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_admin.pkg"
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_app[.-]*pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_app.pkg"
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_app_usage*.pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_app_usage.pkg"
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_launchd*.pkg"
  - Processor: FlatPkgPacker
    Arguments:
      source_flatpkg_dir: "%found_filename%"
      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_launchd.pkg"
  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/munkitools_python*.pkg"
  - Processor: PkgExtractor
    Arguments:
      pkg_path: "%found_filename%"
      extract_root: "%RECIPE_CACHE_DIR%/unpack/python"
#  - Processor: PythonCodeSigner
#    Arguments:
#      files:
#        - 
#        - 
#        - 
#        - 
#  - Processor: FlatPkgPacker
#    Arguments:
#      source_flatpkg_dir: "%RECIPE_CACHE_DIR%/unpack/python"
#      destination_pkg: "%RECIPE_CACHE_DIR%/repack/munkitools_python.pkg"
...
